import asyncio
import random
from telethon import TelegramClient, events

#ايبياتك 
api_id = 1111111
api_hash = '1111111bbbbb'


client = TelegramClient('session_name', api_id, api_hash)
client.start()


saif = {"""اللهُمَ لا تُريني في دراسَتي هماً 
اللهُمَ وفَقني وكُن لي عونآ ومُعيناً.""","وأدخلني برحمتكَ في عبادكَ الصالحين.","(اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي، وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت)..",""""بعيداً عن طمعي بالجنة
‏وخوفي من النار
‏أريد حقاً رؤية الله
‏أريد أن أرى من ذا الذي لطالما آنَسَ وحشَتي
‏وفكَّ كُربَتي
‏وآمَنَ روعاتي
‏ودبَّرَ حياتي
‏من ذا الذي آوانا حينما جافونا
‏من ذا الذي شفانا وأطعمنا وسقانا
‏من غير حولٍ منا ولا قوة
‏اللهم لا تحرمنا لذة النظر لوجهك الكريم"♥️"""}
phrase_frequencies = {"""اللهُمَ لا تُريني في دراسَتي هماً 
اللهُمَ وفَقني وكُن لي عونآ ومُعيناً.""": 600,"(اللهم أنت ربي لا إله إلا أنت، خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي، وأبوء بذنبي فاغفر لي فإنه لا يغفر الذنوب إلا أنت)..": 600,""""بعيداً عن طمعي بالجنة
‏وخوفي من النار
‏أريد حقاً رؤية الله
‏أريد أن أرى من ذا الذي لطالما آنَسَ وحشَتي
‏وفكَّ كُربَتي
‏وآمَنَ روعاتي
‏ودبَّرَ حياتي
‏من ذا الذي آوانا حينما جافونا
‏من ذا الذي شفانا وأطعمنا وسقانا
‏من غير حولٍ منا ولا قوة
‏اللهم لا تحرمنا لذة النظر لوجهك الكريم"♥️""": 600}

async def send_prayer():
#يوزر القناة او الكروب او الحساب الي تريد.تدزله اليوزر وي @ .
    await client.send_message('@brmjeatt', 
                              random.choice(list(phrases)))
@client.on(events.NewMessage(pattern='/start'))
async def start(event):
    await event.reply("""تم تفعيل الاذكار .
الان الحساب سوف يرسل اذكار كل 10 دقائق .""")
    while True:
        await send_prayer()
        await asyncio.sleep(random.choices(list(phrase_frequencies.values()))[0])

@client.on(events.NewMessage(pattern='/stop'))
async def stop(event):
    await event.reply('تم تعطيل الاذكار .')
    quit()

print("ruuuuun .")
client.run_until_disconnected()